/**
 * Trasliteration regular expression rules table for Tamil
 * @author Junaid P V ([[user:Junaidpv]])
 * @date 2010-11-21
 * License: GPLv3, CC-BY-SA 3.0
 */
 // Normal rules
 var rules = {
 '^அa$':'ஆ',
 '^எe$':'ஈ',
 '^அi$':'ஐ',
 '^ஒo$':'ஊ',
 '^அu$':'ஔ',
 
 '^ந்g$':'ஞ்',
 
'^a$':'அ',
'^b$':'a',
'^c$':'க்',
//'^d$':'a',
'^e$':'எ',
//'^f$':'a',
//'^g$':'a',
'^h$':'ஹ்',
'^i$':'இ',
'^j$':'ஜ்',
'^k$':'க்',
'^l$':'ல்',
'^m$':'ம்',
'^n$':'ந்',
'^o$':'ஒ',
'^p$':'ப்',
//'^q$':'a',
'^r$':'ர்',
'^s$':'ஸ்',
'^t$':'த்',
'^u$':'உ',
'^(v|w)$':'வ்',
//'^x$':'a',
'^y$':'ய்',
//'^z$':'a',
'^A$':'ஆ',
'^B$':'a',
'^C$':'a',
'^D$':'a',
'^E$':'ஏ',
'^F$':'a',
'^G$':'a',
'^H$':'a',
'^I$':'ஈ',
'^J$':'a',
'^K$':'a',
'^L$':'ள்',
'^M$':'a',
'^N$':'ண்',
'^O$':'ஓ',
'^P$':'a',
'^Q$':'a',
'^R$':'ற்',
'^S$':'ஶ்',
'^T$':'ட்',
'^U$':'ஊ',
'^V$':'a',
'^W$':'a',
'^X$':'a',
'^Y$':'a',
'^Z$':'a'
};
// Memorised rules
var memrules = {
'^க்h$': ['^.*c$', 'ச்']
};
