/**
 * Avro layout regular expression rules table for Bengali script
 * @author Junaid P V ([[user:Junaidpv]])
 * @date 2010-12-05
 * License: GPLv3, CC-BY-SA 3.0
 */
var tr_bn = {};
tr_bn.text = "Avro";
// Normal rules
tr_bn.rules = {
'([ক-হ])a$':'$1া',
'([ক-হ])i$':'$1ি',
'([ক-হ])I$':'$1ী',
'([ক-হ])u$':'$1ু',
'([ক-হ])U$':'$1ূ',
'([ক-হ])ররi$':'$1ৃ',
'([ক-হ])e$':'$1ে',
'([ক-হ])োI$':'$1ৈ',
'([ক-হ])O$':'$1ো',
'([ক-হ])োU$':'$1ৌ',

'^ক(h|H)$':'খ',
'^গ(h|H)$':'ঘ',
'^ণg$':'ঙ',
'^চ(h|H)$':'ছ',
'^জh$':'ঝ',
'^ণG$':'ঞ',
'^টh$':'ঠ',
'^ডh$':'ঢ',
'^তh$':'থ',
'^দh$':'ধ',
'^(প(h|H)|f)$':'ফ',
'^(ব(h|H)|(v|V))$':'ভ',
'^(সh|S)$':'শ',
'^ড়h$':'ঢ়',
'^ত্`$':'ৎ',
'^নg$':'ং',
'^ঃ`$':':',
'^ররi$':'ঋ',
'^ওI$':'ঐ',
'^ওU$':'ঔ',

'^(k|K)$':'ক',
'^(g|G)$':'গ',
'^(c|C)$':'চ',
'^j$':'জ',
'^T$':'ট',
'^D$':'ড',
'^N$':'ণ',
'^t$':'ত',
'^d$':'দ',
'^n$':'ন',
'^(p|P)$':'প',
'^(b|B)$':'ব',
'^(m|M)$':'ম',
'^z$':'য',
'^r$':'র',
'^(l|L)$':'ল',
'^s$':'স',
'^(h|H)$':'হ',
'^R$':'ড়',
'^(y|Y)$':'য়',

'^o$':'অ',
'^(a|A)$':'আ',
'^i$':'ই',
'^I$':'ঈ',
'^u$':'উ',
'^U$':'ঊ',
'^e$':'এ',
'^O$':'ও',

'^0$':'০',
'^1$':'১',
'^2$':'২',
'^3$':'৩',
'^4$':'৪',
'^5$':'৫',
'^6$':'৬',
'^7$':'৭',
'^8$':'৮',
'^9$':'৯',

'^`$':'্',
'^\\:$':'ঃ',
'^\\^$':'ঁ'
};
// Memorised rules
tr_bn.memrules = {
'^শh$': ['^.*S$', 'ষ']
};
