/**
 * Transliteration regular expression rules table for Kannda script
 * @author Junaid P V ([[user:Junaidpv]])
 * @date 2010-12-26
 * License: GPLv3, CC-BY-SA 3.0
 */
if(tr_kn== undefined) var tr_kn = {};
else tr_kn = {};
tr_kn.text = "Transliteration";
tr_kn.description = "Transliteration sheme for Kannada";
// Normal rules
tr_kn.rules = [
['ಅa', '', 'ಆ'],
['ಇi', '', 'ಈ'],
['(ಉu|ಒo)', '', 'ಊ'],
['ಋR', '', 'ೠ'],
['ಅi', '', 'ಐ'],
['(ಅ|ಒ)u', '', 'ಔ'],
//['([ಅ-ಔೠೡ]|[ಕ-ಹ](

['a', '', 'ಅ'],
['b', '', 'ಡ್'],
['c', '', 'ಚ್'],
['d', '', 'ದ್'],
['e', '', 'ಎ'],
['f', '', 'ಠ್'],
['g', '', 'ಗ್'],
['h', '', 'ಹ್'],
['i', '', 'ಇ'],
['j', '', 'ಜ್'],
['k', '', 'ಕ್'],
['l', '', 'ಲ್'],
['m', '', 'ಮ್'],
['n', '', 'ನ್'],
['o', '', 'ಒ'],
['p', '', 'ಪ್'],
//['q', '', 'X'],
['r', '', 'ರ್'],
['s', '', 'ಸ್'],
['t', '', 'ತ್'],
['u', '', 'ಉ'],
['(v|w)', '', 'ವ್'],
//['x', '', 'X'],
['y', '', 'ಯ್'],
//['z', '', 'X'],
['A', '', 'ಆ'],
//['B', '', 'X'],
//['C', '', 'X'],
['D', '', 'ಡ್'],
['E', '', 'ಏ'],
//['F', '', 'X'],
['G', '', 'ಘ್'],
['H', '', 'ಃ'],
['I', '', 'ಈ'],
//['J', '', 'X'],
//['K', '', 'X'],
['L', '', 'ಳ್'],
//['M', '', 'X'],
['N', '', 'ಣ್'],
['O', '', 'ಓ'],
//['P', '', 'ಠ್'],
//['Q', '', 'X'],
['R', '', 'ಋ'],
//['S', '', 'X'],
['T', '', 'ಟ್ '],
['U', '', 'ಊ'],
//['V', '', 'X'],
//['W', '', 'X'],
//['X', '', 'X'],
//['Y', '', 'X'],
//['Z', '', 'X'],
];
