/**
 * Trasliteration regular expression rules table for Tamil
 * @author Junaid P V ([[user:Junaidpv]])
 * @date 2010-11-21
 * License: GPLv3, CC-BY-SA 3.0
 */
 // Normal rules
 var rules = {
'^([க-ஹ])்a$':'$1',
'^([க-ஹ])(்A|a)$':'$1ா',
'^([க-ஹ])்i$':'$1ி',
'^([க-ஹ])(்I|ிi)$':'$1ீ',
'^([க-ஹ])்u$':'$1ு',
'^([க-ஹ])(்U|ுu)$':'$1ூ',
'^([க-ஹ])்e$':'$1ெ',
'^([க-ஹ])(்E|ெe)$':'$1ே',
'^([க-ஹ])i$':'$1ை',
'^([க-ஹ])்o$':'$1ொ',
'^([க-ஹ])(்O|ொo)$':'$1ோ',
'^([க-ஹ])u$':'$1ௌ',

'^([க-ஹ][ெ-்]?)n$':'$1ன்',
 
'^அa$':'ஆ',
'^இi$':'ஈ',
'^உu$':'ஊ',
'^எe$':'ஏ',
'^அi$':'ஐ',
'^ஒo$':'ஓ',
'^அu$':'ஔ',
 
'^ந்g$':'ங்',
'^ந்j$':'ஞ்',
'^த்h$':'த்',
'^ஸ்h$':'ஷ்',
 
'^a$':'அ',
'^c$':'க்',
'^d$':'ட்',
'^e$':'எ',
'^h$':'ஹ்',
'^i$':'இ',
'^j$':'ஜ்',
'^k$':'க்',
'^l$':'ல்',
'^m$':'ம்',
'^n$':'ந்',
'^o$':'ஒ',
'^p$':'ப்',
'^q$':'ஃ',
'^r$':'ர்',
'^s$':'ச்',
'^t$':'த்',
'^u$':'உ',
'^(v|w)$':'வ்',
'^y$':'ய்',
'^z$':'ழ்',
'^A$':'ஆ',

'^C$':'க்க்',
'^E$':'ஏ',
'^H$':'ஃ',
'^I$':'ஈ',
'^J$':'ஜ்ஜ்',
'^K$':'க்',
'^L$':'ள்',
'^M$':'ம்ம்',
'^N$':'ண்',
'^O$':'ஓ',
'^P$':'ப்ப்',
'^R$':'ற்',
'^S$':'ஸ்',
'^T$':'ட்',
'^U$':'ஊ',
'^(V|W)$':'வ்வ்',
'^Y$':'ய்ய்',
'^Z$':'ஶ்',

'^~$':'்'
};
// Memorised rules
var memrules = {
'^க்h$': ['^.*c$', 'ச்'],
'^த்h$':['^.*h$','த்ஹ்'],
'^ஶ்h$':['^.*z$','ழ்']
};
