/**
 * Trasliteration regular expression rules table for Tamil
 * @author Junaid P V ([[user:Junaidpv]])
 * @date 2010-11-21
 * License: GPLv3, CC-BY-SA 3.0
 */
 // Normal rules
 var rules = {
'^([க-ஹ])்a$':'$1',
'^([க-ஹ])(்A|a)$':'$1ா',
'^([க-ஹ])்i$':'$1ி',
'^([க-ஹ])(்I|ெe)$':'$1ீ',
'^([க-ஹ])்u$':'$1ு',
'^([க-ஹ])(்U|ொo|ுu)$':'$1ூ',
'^([க-ஹ])்e$':'$1ெ',
'^([க-ஹ])்E$':'$1ே',
'^([க-ஹ])i$':'$1ை',
'^([க-ஹ])்o$':'$1ொ',
'^([க-ஹ])்O$':'$1ோ',
'^([க-ஹ])u$':'$1ௌ',

'^([க-ஹ][ெ-்]?)n$':'$1ன்',
 
 '^அa$':'ஆ',
 '^எe$':'ஈ',
 '^அi$':'ஐ',
 '^ஒo$':'ஊ',
 '^அu$':'ஔ',
 
 '^ந்g$':'ங்',
 '^ந்j$':'ஞ்',
 '^ஸ்h$':'ஷ்',
 
'^a$':'அ',
'^c$':'க்',
'^e$':'எ',
'^h$':'ஹ்',
'^i$':'இ',
'^j$':'ஜ்',
'^k$':'க்',
'^l$':'ல்',
'^m$':'ம்',
'^n$':'ந்',
'^o$':'ஒ',
'^p$':'ப்',
'^r$':'ர்',
'^s$':'ஸ்',
'^t$':'த்',
'^u$':'உ',
'^(v|w)$':'வ்',
'^y$':'ய்',
'^z$':'ஶ்',
'^A$':'ஆ',

'^C$':'க்க்',
'^E$':'ஏ',
'^H$':'ஃ',
'^I$':'ஈ',
'^J$':'ஜ்ஜ்',
'^K$':'க்',
'^L$':'ள்',
'^M$':'ம்ம்',
'^N$':'ண்',
'^O$':'ஓ',
'^P$':'ப்ப்',
'^R$':'ற்',
'^S$':'ஶ்',
'^T$':'ட்',
'^U$':'ஊ',
'^(V|W)$':'வ்வ்',
'^Y$':'ய்ய்',
'^Z$':'ஶ்',

'^~$':'்'
};
// Memorised rules
var memrules = {
'^க்h$': ['^.*c$', 'ச்'],
'^ஶ்h$':['^.*z$','ழ்']
};
